
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ЗаявкаЗакрытаПриИзмененииНаСервере()
	Если Объект.ЗаявкаЗакрыта = Истина И Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Выполнена Тогда
		Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Закрыта;
	Иначе
		Сообщить("Заявка не может быть закрыта, т.к. не все назначенные наряды были выполнены или отменены!");
		Объект.ЗаявкаЗакрыта = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаЗакрытаПриИзменении(Элемент)
	
	ЗаявкаЗакрытаПриИзмененииНаСервере();
	Если Объект.ЗаявкаЗакрыта = Истина Тогда
		Элементы.Группа1.ТолькоПросмотр = Истина;
		Элементы.Клиент.ТолькоПросмотр = Истина;
		Элементы.Описание.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Группа1.ТолькоПросмотр = Ложь;
		Элементы.Клиент.ТолькоПросмотр = Ложь;
		Элементы.Описание.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры
